РП/src/Documents/РегистрУчета/РегистрУчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РегистрУчета</name>
  <posting>Deny</posting>
  <attributes>
    <name>ВидРегистра</name>
    <type>
      <types>CatalogRef.ВидыРегистровУчета</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьОбособленныеПодразделения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматСохраненияФайла</name>
    <type>
      <types>EnumRef.ФорматыСохраненияОтчетов</types>
    </type>
  </attributes>
</mdclass:Document>

РП/src/Catalogs/РегистрУчетаПрисоединенныеФайлы/РегистрУчетаПрисоединенныеФайлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РегистрУчетаПрисоединенныеФайлы</name>
  <attributes>
    <name>Автор</name>
    <comment>Автор - пользователь, добавивший файл</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецФайла</name>
    <type>
      <types>DocumentRef.РегистрУчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаМодификацииУниверсальная</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <comment>Дата добавления файла в базу</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Зашифрован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Изменил</name>
    <comment>Автор - пользователь, добавивший файл</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексКартинки</name>
    <comment>Индекс иконки, соответствующей расширению файла, для показа в списке</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <comment>Описание файла</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписанЭП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлу</name>
    <comment>Дополнительный путь к файлу на диске (в случае если Тип хранения файла - на диске)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <comment>Размер файла</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расширение</name>
    <comment>Расширение файла версии</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Редактирует</name>
    <comment>Пользователь, занявший файл для редактирования</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусИзвлеченияТекста</name>
    <type>
      <types>EnumRef.СтатусыИзвлеченияТекстаФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстХранилище</name>
    <comment>Текст, извлеченный из файла - для полнотекстового поиска</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипХраненияФайла</name>
    <comment>Где хранятся файлы - в базе как хранилище значения или в каталоге на диске</comment>
    <type>
      <types>EnumRef.ТипыХраненияФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>Том</name>
    <comment>Ссылка на том (в случае если тип хранения файла - на диске)</comment>
    <type>
      <types>CatalogRef.ТомаХраненияФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлХранилище</name>
    <comment>Служебное поле для обмена файлами в РИБ</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЭлектронныеПодписи</name>
    <attributes>
      <name>ДатаПодписи</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяФайлаПодписи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>260</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КомуВыданСертификат</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Отпечаток</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подпись</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>УстановившийПодпись</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <comment>Двоичные данные сертификата</comment>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СертификатыШифрования</name>
    <attributes>
      <name>Отпечаток</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <comment>Двоичные данные сертификата</comment>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

РП/src/Documents/РегистрУчета/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		
		ПодготовитьФормуНаСервере();
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПодготовитьФормуНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	МассивНепроверяемыхРеквизитов.Добавить("Объект");
	
	Если НЕ ЗначениеЗаполнено(Объект.ВидРегистра) Тогда
		ТекстСообщения = НСтр("ru='Поле ""Вид регистра"" не заполнено';uk='Поле ""Вид регістра"" не заповнене'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "Объект.ВидРегистра", , Отказ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Дата) Тогда
		ТекстСообщения = НСтр("ru='Поле ""Дата"" не заполнено';uk='Поле ""Дата"" не заповнене'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "Объект.Дата", , Отказ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.НачалоПериода) Тогда
		ТекстСообщения = НСтр("ru='Поле ""Начало периода"" не заполнено';uk='Поле ""Початок періоду"" не заповнене'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "Объект.НачалоПериода", , Отказ);
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.КонецПериода) Тогда
		ТекстСообщения = НСтр("ru='Поле ""Конец периода"" не заполнено';uk='Поле ""Кінець періоду"" не заповнене'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "Объект.КонецПериода", , Отказ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		ТекстСообщения = НСтр("ru='Поле ""Организация"" не заполнено';uk='Поле ""Організація"" не заповнене'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , , "ПолеОрганизация", Отказ);
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаполнитьСвойстваПрисоединенногоФайла();
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_ПрисоединенныйФайл" И Источник = ПрисоединенныйФайлРегистра Тогда
		ЗаполнитьСвойстваПрисоединенногоФайла();
		УправлениеФормой(ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
	
&НаКлиенте
Процедура ПолеОрганизацияОткрытие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБПКлиент.ПолеОрганизацияОткрытие(Элемент, СтандартнаяОбработка,
		ПолеОрганизация, СоответствиеОрганизаций);
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
	
&НаКлиенте
Процедура ОткрытьПрисоединенныйФайл(Команда)
	
	Если ЗначениеЗаполнено(ПрисоединенныйФайлРегистра) Тогда
		ПрисоединенныеФайлыКлиент.ОткрытьФормуПрисоединенногоФайла(ПрисоединенныйФайлРегистра);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
	
&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	ОбщегоНазначенияБПВызовСервера.ЗаполнитьСписокОрганизаций(Элементы.ПолеОрганизация, СоответствиеОрганизаций);
	
	ОбщегоНазначенияБПКлиентСервер.УстановитьЗначениеПолеОрганизация(
			ПолеОрганизация, Объект.Организация, Объект.ВключатьОбособленныеПодразделения);
	
	ЗаполнитьСвойстваПрисоединенногоФайла();
	
	Заголовок = Объект.Описание;
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСвойстваПрисоединенногоФайла()
	
	СвойстваПрисоединенногоФайла = Документы.РегистрУчета.ПолучитьСвойстваПрисоединенногоФайлаРегистра(Объект.Ссылка);
	ПрисоединенныйФайлРегистра   = СвойстваПрисоединенногоФайла.ПрисоединенныйФайл;
	ПодписанЭП                   = СвойстваПрисоединенногоФайла.ПодписанЭП;
	ФайлРегистраУчетаПрисоединен = ПрисоединенныйФайлРегистра <> Справочники.РегистрУчетаПрисоединенныеФайлы.ПустаяСсылка();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	
	Элементы.ДекорацияПодпись.Доступность = Форма.ФайлРегистраУчетаПрисоединен;
	
КонецПроцедуры

#КонецОбласти
